//
//  RecipesDataManager.swift
//  ShopingList
//
//  Created by ALEKSEY SUSLOV on 22.02.2021.
//

class RecipesDataManager {
    
    static let shared = RecipesDataManager()
    
    var recipes = [
        
        "Рагу" : [
            "Мясо": 500,
            "Картофель": 4,
            "Лук": 1,
            "Морковь": 2,
            "Капуста": 0.25,
            "Томатная паста": 1,
            "Соль": 1,
            "Перец черный молотый": 1,
            "Масло растительное": 1,
            "Зелень": 1
        ],
        
        "Цезарь" : [
            "Листья салата": 100,
            "Куринное филе": 200,
            "Крутоны (сухарики)": 50,
            "Пармезан": 50,
            "Яйца куринные": 2,
            "Петрушка": 1,
            "Соус для Цезаря": 1
        ]
    ]
    
    private init() {}
}
