//
//  RecipesDataManager.swift
//  ShopingList
//
//  Created by ALEKSEY SUSLOV on 22.02.2021.
//

class RecipesDataManager {
    
    static let shared = RecipesDataManager()
    
//    var recipes = [
//
//        "Рагу" : [
//            "Мясо": 500,
//            "Картофель": 4,
//            "Лук": 1,
//            "Морковь": 2,
//            "Капуста": 0.25,
//            "Томатная паста": 1,
//            "Соль": 1,
//            "Перец черный молотый": 1,
//            "Масло растительное": 1,
//            "Зелень": 1
//        ],
//
//        "Цезарь" : [
//            "Листья салата": 100,
//            "Куринное филе": 200,
//            "Крутоны (сухарики)": 50,
//            "Пармезан": 50,
//            "Яйца куринные": 2,
//            "Петрушка": 1,
//            "Соус для Цезаря": 1
//        ]
//    ]
    
    var recipes2: [String: [String: (quantity: Double, unitOfQuantity: String)]] = [
        
        "Рагу" : [
            "Мясо": (500, "кг."),
            "Картофель": (4, "шт."),
            "Лук": (1, "шт."),
            "Морковь": (2, "шт."),
            "Капуста": (0.25, "шт."),
            "Томатная паста": (1, "банка."),
            "Соль": (1, "пачка."),
            "Перец черный молотый": (1, "пакетик."),
            "Масло растительное": (1, "бутылка."),
            "Зелень": (1, "пучек.")
        ],
        
        "Цезарь" : [
            "Листья салата": (0.1, "кг."),
            "Куринное филе": (0.2, "кг."),
            "Крутоны (сухарики)": (50, "гр."),
            "Пармезан": (50, "гр."),
            "Яйца куринные": (2, "шт."),
            "Петрушка": (1, "пучек."),
            "Соус для Цезаря": (1, "шт.")
        ]
    ]
    
    private init() {}
}
